Repository: Belfagor2005/Archimede-M3UConverter
Catalog: usr/lib/enigma2/python/Plugins/Extensions/M3UConverter/locale/*/LC_MESSAGES/M3UConverter.po
Languages: it

source: Single Bouquet
it: Bouquet Singolo

source: Multiple Bouquets
it: Bouquets Multipli

source: Top
it: In Alto

source: Bottom
it: In Basso

source: EPGShare Mode
it: Modalità EPGShare

source: Standard Mode
it: Modalità Standard

source: Only DVB
it: Solo DVB

source: Only Rytec
it: Solo Rytec

source: Only DTT
it: Solo DTT

source: Enigma2 Bouquets to ➔ Enigma2 Bouquets
it: Enigma2 Bouquets in ➔ Enigma2 Bouquets

source: Enigma2 Bouquets to ➔ M3U
it: Enigma2 Bouquets in ➔ M3U

source: M3U to ➔ Enigma2 Bouquets
it: M3U a ➔ Bouquets Enigma2

source: M3U to ➔ JSON
it: Converti M3U in JSON

source: JSON to ➔ Enigma2 Bouquets
it: JSON a ➔ Bouquets Enigma2

source: JSON to ➔ M3U
it: Converti JSON in M3U

source: XSPF to ➔ M3U Playlist
it: XSPF a ➔ M3U Playlist

source: Remove M3U Bouquets
it: Rimuovere Bouquets M3U

source: Plugin Information
it: Informazioni sul Plugin

source: We're ready: what do you want to do?
it: Siamo pronti: cosa vuoi fare?

source: Close
it: Esci

source: Select
it: Seleziona

source: Remove Bouquets
it: Rimuovere Bouquet

source: Press RED to select file
it: Premere ROSSO per selezionare il file

source: Error opening plugin information: %s
it: Errore durante l'apertura delle informazioni del plugin: %s

source: EPGImport plugin not found
it: Plugin EPGImport non trovato

source: Removed {count} bouquet(s): {files}
it: Rimossi {count} bouquet: {files}

source: No M3UConverter bouquets found to remove.
it: Nessun bouquet M3UConverter trovato da rimuovere.

source: Enigma2 Bouquet to Enigma2 Bouquet Conversion
it: Converti da M3U in Enigma2 Bouquets

source: M3U to Enigma2 Bouquet Conversion
it: Conversione da M3U in Enigma2 Bouquet

source: Enigma2 Bouquet to M3U Conversion
it: Conversione da Enigma2 Bouquet in M3U

source: JSON to Enigma2 Bouquet Conversion
it: Conversione da JSON in Enigma2 Bouquet

source: JSON to M3U Conversion
it: Conversione da JSON a M3U

source: XSPF to M3U Playlist Conversion
it: Conversione da XSPF in M3U

source: M3U to JSON Conversion
it: Conversione da M3U in JSON

source: Ready
it: Pronto

source: Open File
it: Apri File

source: Tools
it: Strumenti

source: Ready: Select the file from the %s you configured in settings.
it: Pronto: seleziona il file dal %s configurato nelle impostazioni.

source: File loaded: {}
it: File caricato: {}

source: Error opening file browser: %s
it: Impossibile aprire il file browser %s

source: No file selected for conversion
it: Nessun file selezionato per la conversione %s

source: Convert TV to TV
it: Converti Enigma2 Bouquets in Enigma2 Bouquets

source: Convert M3U to TV
it: Converti M3U in TV

source: Convert TV to M3U
it: Converti TV in M3U

source: Convert JSON to TV
it: Converti JSON in TV

source: Convert JSON to M3U
it: Converti JSON in M3U

source: Convert XSPF to M3U
it: Converti XSPF in M3U

source: Convert M3U to JSON
it: Converti M3U in JSON

source: Convert
it: Converti

source: Conversion in progress...
it: Conversione in corso...

source: Unsupported conversion type
it: Tipo di conversione non supportato

source: No conversion data available.
it: Nessun dato di conversione disponibile.

source: Manual editing completed - ready for conversion
it: Modifica manuale completata - pronto per la conversione

source: No file selected
it: Nessun file selezionato

source: Invalid .tv item format
it: Formato file .tv non valido

source: Invalid .m3u item format
it: Formato file .m3u non valido

source: Playing: %s
it: Riproduzione: %s

source: 📋 Plugin Info
it: 📋 Informazioni sul plugin

source: 📊 EPG Cache Statistics
it: 📊 Statistiche della cache EPG

source: 💾 Create Backup
it: 💾 Crea backup

source: 🔄 Reload EPG Database
it: 🔄 Ricarica il database EPG

source: 🔄 Reload Services
it: 🔄 Ricarica Servizi

source: 🧹 Clear EPG Cache
it: 🧹 Cancella la cache EPG

source: 🗑️ Clear Log File
it: 🗑️ Cancella file di registro

source: 🗃️ === Manual Database Management ===
it: 🗃️ === Gestione manuale del database ===

source: ✏️ Open Database Editor
it: ✏️ Apri l'editor del database

source: 👁️ View Manual Database
it: 👁️ Visualizza il database manuale

source: 📝 Manual Match Editing
it: 📝 Modifica manuale delle Corrispondenze

source: 📤 Export Manual Database
it: 📤 Esporta database manuale

source: 📥 Import Manual Database
it: 📥 Importa database manuale

source: 🧹 Clean Manual Database
it: 🧹 Pulisci database manuale

source: Advanced Tools Menu
it: Menu Strumenti Avanzati

source: EPG mapper not available
it: Mappatore EPG non disponibile

source: No statistics available
it: Nessuna statistica disponibile

source: No conversion statistics available. Run a conversion first to see statistics.
it: Nessuna statistica di conversione disponibile. Esegui prima una conversione per visualizzare le statistiche.

source: 📊 EPG STATISTICS - {}
it: 📊 STATISTICHE EPG - {}

source: No conversion statistics available.
it: Nessuna statistica di conversione disponibile.

source: Run a conversion first to see statistics.
it: Esegui prima una conversione per visualizzare le statistiche.

source: 🎯 TOTAL CHANNELS: {}
it: 🎯 CANALI TOTALI: {}

source: 📈 EPG COVERAGE: {:.1f}%
it: 📈 COPERTURA EPG: {:.1f}%

source: 🔧 MATCH BREAKDOWN:
it: 🔧 ANALISI CORRISPONDENZE::

source: • 💾 Manual DB: {} ({:.1f}%)
it: • 💾 DB manuale: {} ({:.1f}%)

source: 💾 CACHE PERFORMANCE:
it: 💾 PRESTAZIONI DELLA CACHE:

source: • Hit: {} ({:.1f}%)
it: • Risultato: {} ({:.1f}%)

source: • Miss: {}
it: • Mancanti: {}

source: • Size: {} entries
it: • Dimensione: {} voci

source: 🗄️ DATABASE INFO:
it: 🗄️ INFO DATABASE:

source: • Rytec: {} channels
it: • Rytec: {} canali

source: • DVB: {} channels
it: • DVB: {} canali

source: • Mode: {}
it: • Modalità: {}

source: EPG database reloaded successfully!
it: Database EPG ricaricato con successo!

source: Failed to initialize EPG mapper - check logs
it: Impossibile inizializzare il mapper EPG: controllare i registri

source: Error reloading EPG database: {}
it: Errore durante il ricaricamento del database EPG: {}

source: EPG cache cleared! {} entries removed
it: Cache EPG cancellata! {} voci rimosse

source: Error clearing EPG cache
it: Errore durante la cancellazione della cache EPG

source: EPG mapper not initialized
it: EPG mapper non inizializzato

source: Backup created successfully!
it: Backup creato con successo!

source: Backup failed: {}
it: Backup non riuscito: {}

source: Reloading services...
it: Ricarica Servizi..

source: Service reload initiated
it: Ricaricamento del servizio avviato

source: Service reload command sent successfully. Bouquets should appear shortly.
it: Comando di ricarica del servizio inviato con successo. I bouquet dovrebbero apparire a breve.

source: Error initiating service reload
it: Errore durante l'avvio del ricaricamento del servizio

source: Manual database not available
it: Database manuale non disponibile

source: No manual corrections found
it: Nessuna correzione manuale trovata

source: ✏️ Edit this mapping
it: ✏️ Modifica questa mappatura

source: 🗑️ Delete this mapping
it: 🗑️ Elimina questa mappatura

source: 🔙 Back
it: 🔙 Torna

source: Action for: {}
it: Azione per: {}

source: Manual Corrections ({} total)
it: Correzioni manuali ({} totali)

source: This will delete ALL manual corrections. Total corrections: {} This action cannot be undone. Are you sure?
it: Questa operazione eliminerà TUTTE le correzioni manuali. Correzioni totali: {} Questa azione non può essere annullata. Sei sicuro?

source: Manual database cleared
it: Database manuale cancellato

source: Error clearing database
it: Errore durante la cancellazione del database

source: No manual corrections to export
it: Nessuna correzione manuale da esportare

source: Manual database exported successfully! File: {} Location: {} Corrections: {} Size: {} bytes
it: Database manuale esportato correttamente! File: {} Posizione: {} Correzioni: {} Dimensione: {} byte

source: Error exporting database
it: Errore durante l'esportazione del database

source: Database Directory
it: Elenco dei database

source: Temporary Files
it: File temporanei

source: No database files found in: {}
it: Nessun file database trovato in: {}

source: 🔙 Back to locations
it: 🔙 Torna alle posizioni

source: Select file to import from {}
it: Seleziona il file da importare da {}

source: 🔙 Back to Tools
it: 🔙 Torna agli Strumenti

source: Select import location
it: Seleziona la posizione di importazione

source: Error starting import: {}
it: Errore durante l'avvio dell'importazione: {}

source: Log file cleared successfully
it: File di registro cancellato correttamente

source: Delete manual correction for: {} This action cannot be undone.
it: Elimina correzione manuale per: {} Questa azione non può essere annullata.

source: Error deleting correction
it: Errore durante l'eliminazione della correzione

source: Import file not found: {}
it: File di importazione non trovato: {}

source: Invalid database file structure
it: Struttura del file di database non valida

source: Error importing database: {}
it: Errore durante l'importazione del database: {}

source: replaced
it: sostituito

source: merged
it: unito

source: Database import successful! {} mappings {}. Total mappings now: {} Mode: {}
it: Importazione del database riuscita! {} mappature {}. Totale mappature ora: {} Modalità: {}

source: Error saving imported database
it: Errore durante il salvataggio del database importato

source: Error finalizing import: {}
it: Errore durante la finalizzazione dell'importazione: {}

source: 📊 IMPORT PREVIEW
it: 📊 ANTEPRIMA IMPORTAZIONE

source: 📈 Statistics:
it: 📈 Statistiche:

source: • Total in import file: {}
it: • Totale nel file di importazione: {}

source: • New mappings: {}
it: • Nuove mappature: {}

source: • Duplicate mappings: {}
it: • Mappature duplicate: {}

source: • Current total: {}
it: • Totale attuale: {}

source: 🆕 New mappings ({}):
it: 🆕 Nuove mappature ({}):

source: 🔄 Duplicates ({}):
it: 🔄 Duplicati ({}):

source: 🔄 Replace All ({} mappings)
it: 🔄 Sostituisci tutto ({} mappature)

source: ➕ Merge (keep both)
it: ➕ Unisci (mantieni entrambi)

source: 📊 Preview Changes
it: 📊 Anteprima delle modifiche

source: Import {} mappings from {}
it: Importa {} mappature da {}

source: Invalid selection
it: Selezione non valida

source: Processing selection...
it: Elaborazione della selezione...

source: File not found
it: File non trovato

source: Ready to convert
it: Pronto per la conversione

source: Match Editor
it: Editor di partite

source: Loaded first %d channels. Press Green to convert.
it: Caricati i primi %d canali. Premi Verde per convertire.

source: Large file detected: {:.1f}MB. Processing first {} channels...
it: Rilevato file di grandi dimensioni: {:.1f}MB. Elaborazione dei primi {} canali...

source: No IPTV channels found in the bouquet
it: Nessun canale IPTV trovato nel bouquet

source: Error parsing TV bouquet file: %s
it: Errore durante l'analisi del file TV Bouquet: %s

source: Error parsing JSON file. Please check the format. Error: %s
it: Errore durante l'analisi del file JSON. Controllare il formato. Errore: %s

source: Conversion already in progress
it: Conversione già in corso

source: Cancel
it: Annulla

source: Converting: {name} ({percent}%)
it: Conversione: {name} ({percent}%)

source: File write error: %s
it: Errore di scrittura del file: %s

source: tv_to_m3u Conversion error: %s
it: errore di conversione TVM3U: %s

source: No channels loaded. Please select a valid TV bouquet file.
it: Nessun canale caricato. Seleziona un file bouquet TV valido.

source: Converting: {} ({}%)
it: Conversione: {} ({}%)

source: No valid channels found in the JSON file
it: Nessun canale valido trovato nel file JSON

source: Converting: {title} ({percent}%)
it: Conversione: {title} ({percent}%)

source: Invalid XSPF file
it: File XSPF non valido

source: XSPF conversion error: %s
it: Errore di conversione XSPF: %s

source: Manual editing completed
it: Modifica manuale completata

source: Conversion failed: Invalid result
it: Conversione fallita: risultato non valido

source: Unknown error
it: Errore Sconosciuto

source: Conversion failed: {}
it: Conversione fallita: {}

source: Conversion completed
it: Conversione completata

source: Error processing conversion result
it: Errore durante l'avvio della conversione

source: ✅ CONVERSION COMPLETED SUCCESSFULLY 📁 Bouquet: {} 🕒 Completed at: {} 📍 Location: /etc/enigma2/userbouquet.*.tv Press OK to continue
it: ✅ CONVERSIONE COMPLETATA CON SUCCESSO 📁 Bouquet: {} 🕒 Completato alle: {} 📍 Posizione: /etc/enigma2/userbouquet.*.tv Premi OK per continuare

source: 🎯 CONVERSION COMPLETE
it: 🎯 CONVERSIONE COMPLETATA

source: 📊 Total channels in file: {}
it: 📊 Numero totale di canali nel file: {}

source: ✅ Valid channels processed: {}
it: ✅ Canali validi elaborati: {}

source: 🚫 Skipped channels: {}
it: 🚫 Canali saltati: {}

source: 🎯 Effective EPG matches: {}
it: 🎯 Corrispondenze EPG efficaci: {}

source: 📈 EFFECTIVE EPG coverage: {}
it: 📈 Copertura EPG EFFICACE: {}

source: ✏️ Manual edits applied: {}
it: ✏️ Modifiche manuali applicate: {}

source: 🕒 Edited at: {}
it: 🕒 Modificato alle: {}

source: 🗄️ Database mode: {}
it: 🗄️ Modalità database: {}

source: 🛰️ Rytec EPG matches: {}
it: 🛰️ Corrispondenze Rytec EPG: {}

source: 📺 DVB EPG matches: {}
it: 📺 Corrispondenze EPG DVB: {}

source: 📡 DVB-T EPG matches: {}
it: 📡 Corrispondenze EPG DVB-T: {}

source: 🔌 Fallback (no EPG): {}
it: 🔌 Fallback (senza EPG): {}

source: (Based on selected database mode: {})
it: (In base alla modalità di database selezionata: {})

source: 💾 Cache efficiency: {}
it: 💾 Efficienza della cache: {}

source: 🔍 Cache size: {} entries
it: 🔍 Dimensione cache: {} voci

source: 🗄️ Rytec channels in DB: {}
it: 🗄️ Canali Rytec nel DB: {}

source: 📡 DVB channels in DB: {}
it: 📡 Canali DVB nel DB: {}

source: 💾 Output file: {}
it: 💾 File di output: {}

source: 📁 File size: {}
it: 📁 Dimensione del file: {}

source: 💾 Manual DB matches: {}
it: 💾 Corrispondenze manuali del DB: {}

source: (Reused previous manual corrections)
it: (Riutilizzate le precedenti correzioni manuali)

source: ⏱️ Conversion type: {}
it: ⏱️Tipo di Conversione: {}

source: 🕒 Completed at: {}
it: 🕒 Completato alle: {}

source: ✅ Status: Completed successfully
it: ✅ Stato: Completato con successo

source: ❌ Error generating statistics
it: ❌ Errore durante la generazione delle statistiche

source: Cancelling...
it: Annullamento...

source: Stopped
it: Fermato

source: Cancelling conversion...
it: Annullamento della conversione in corso...

source: Conversion cancelled
it: Conversione fallita

source: Conversion error: %s
it: Errore di conversione: %s

source: Playback error
it: Errore di riproduzione

source: No conversion data available. Please run a conversion first.
it: Nessun dato di conversione disponibile. Eseguire prima una conversione.

source: Ready for next operation
it: Pronto per la prossima operazione

source: Manual EPG Match Editor
it: Editor Corrispondenze EPG manuale

source: Select a channel to correct the match
it: Seleziona un canale per correggere la corrispondenza

source: Save All
it: Salva tutto

source: Undo
it: Annulla

source: Reset
it: Ripristina

source: No MANUAL changes to save
it: Nessuna modifica MANUALE da salvare

source: Saved {} MANUAL corrections
it: Salvate {} correzioni manuali

source: No MANUAL corrections saved
it: Nessuna correzione MANUALE salvata

source: Save error
it: Errore di salvataggio

source: You have unsaved manual changes. Do you want to save before closing?
it: Hai modifiche manuali non salvate. Vuoi salvare prima di chiudere?

source: EPG Coverage: {}/{} channels ({:.1f}%)
it: Copertura EPG: {}/{} canali ({:.1f}%)

source: Channel: {} | {} | Match: {} | Press RIGHT for matches
it: Canale: {} | {} | Corrispondenza: {} | Premi DESTRA per le corrispondenze

source: Searching matches for: {}...
it: Ricerca corrispondenze per: {}...

source: Found {} matches for: {} | Select and press OK
it: Trovate {} corrispondenze per: {} | Seleziona e premi OK

source: No matches found for: {}
it: Nessuna corrispondenza trovata per: {}

source: Found {} matches so far for: {} | Searching...
it: Trovate finora {} corrispondenze per: {} | Ricerca in corso...

source: First select a match from the right list (use RIGHT arrow)
it: Per prima cosa seleziona una corrispondenza dall'elenco a destra (usa la freccia DESTRA)

source: Please select a valid match from the right list
it: Seleziona una corrispondenza valida dall'elenco a destra

source: EPG assigned: {} | {}
it: EPG assegnato: {} | {}

source: No actions to undo
it: Nessuna azione da annullare

source: Undo: Restored previous state for {}
it: Annulla: ripristinato lo stato precedente per {}

source: Error: Channel index out of range
it: Errore: indice del canale fuori intervallo

source: Error undoing action
it: Errore durante l'annullamento dell'azione

source: Match reset for: {}
it: Reimpostazione della corrispondenza per: {}

source: Select a channel to edit (use OK or RIGHT to go to matches)
it: Seleziona un canale da modificare (usa OK o DESTRA per andare alle corrispondenze)

source: No channels available
it: Nessun canale disponibile

source: Please select a channel first
it: Seleziona prima un canale

source: Select a match and press OK to assign
it: Seleziona una corrispondenza e premi OK per assegnarla

source: No matches found - try different search
it: Nessuna corrispondenza trovata - prova una ricerca diversa

source: Manual Database Editor
it: Editor Database Manuale

source: Loading database...
it: Caricamento database...

source: Delete
it: Elimina

source: Duplicates
it: Duplicati

source: No duplicates found
it: Nessun duplicato trovato

source: Done
it: Fatto

source: Selection mode active. Select items with OK
it: Modalità di selezione attiva. Selezionare gli elementi con OK

source: Error loading database
it: Errore durante il caricamento del database

source: No duplicates available for selection
it: Nessun duplicato disponibile per la selezione

source: Selection mode: Select items with OK
it: Modalità di selezione: selezionare gli elementi con OK

source: Selection mode off
it: Modalità di selezione disattivata

source: No mappings available
it: Nessuna mappatura disponibile

source: No duplicates found in the database
it: Nessun duplicato nel database

source: >>> SELECTION MODE - Select items with OK
it: >>> MODALITÀ DI SELEZIONE - Seleziona gli elementi con OK

source: >>> {} duplicate groups, {} total mappings
it: >>> {} gruppi duplicati, {} mappature totali

source: >>> DUPLICATES VIEW
it: >>> VISUALIZZAZIONE DUPLICATI

source: >>> {} groups, {} mappings total
it: >>> {} gruppi, {} mappature totali

source: --- {} ({} duplicates) ---
it: --- {} ({} duplicati) ---

source: All Mappings
it: Mappature

source: SELECTION MODE: {} items selected
it: MODALITÀ DI SELEZIONE: {} elementi selezionati

source: - {} duplicate groups
it: - {} gruppi duplicati

source: DUPLICATES: {} groups, {} mappings
it: DUPLICATI: {} gruppi, {} mappature

source: ALL MAPPINGS: {} total
it: TUTTE LE MAPPATURA: {} totale

source: No items selected for deletion
it: Nessun file selezionato per l'eliminazione

source: Delete {} selected items? This action cannot be undone.
it: Eliminare {} elementi selezionati? Questa azione non può essere annullata.

source: Deleted {} items. Still in selection mode.
it: {} elementi eliminati. Ancora in modalità selezione.

source: Deleted {} items. No more duplicates.
it: Eliminati {} elementi. Non ci sono più duplicati.

source: Deleted {} items
it: {} elementi eliminati

source: Error deleting items
it: Errore durante l'eliminazione degli elementi

source: Please select a mapping (not a group header)
it: Seleziona una mappatura (non un'intestazione di gruppo)

source: Please select a mapping to delete
it: Seleziona una mappatura da eliminare

source: Delete manual mapping? Channel: {} Type: {} This action cannot be undone.
it: Eliminare la mappatura manuale? Canale: {} Tipo: {} Questa azione non può essere annullata.

source: Mapping deleted successfully
it: Mappatura cancellata con successo

source: Error deleting mapping
it: Errore durante l'eliminazione della mappatura

source: You have unsaved changes in the database. Do you want to save before closing?
it: Ci sono modifiche non salvate nel database. Vuoi salvare prima di chiudere?

source: Universal Converter
it: Convertitore Universale

source: Convert between M3U Enigma2 Bouquets Json
it: Converti tra M3U Enigma2 Bouquets Json

source: Prev
it: Precedente

source: Next
it: Successivo

source: Network Storage
it: Memoria Network

source: Temporary
it: Temp
